[
    {
        "title": "Here's the moment Nvidia became the AI king and what it must do this week to keep the throne",
        "text": "Here's the moment Nvidia became the AI king and what it must do this week to keep the throne The zeitgeist of Nvidia's trajectory is so fought that even Jim Cramer dreads Wednesday's closing bell.",
        "source": "CNBC",
        "link": "https://www.cnbc.com/2024/05/19/what-nvidia-must-deliver-in-earnings-this-week-to-remain-ai-king.html",
        "published_at": "2024-05-19T21:00:13+00:00",
        "type": "article"
    },
    {
        "title": "How are you using AI to cope with grief? We want to hear from you",
        "text": "How are you using AI to cope with grief? We want to hear from you With the rise of advanced language models such as OpenAI’s ChatGPT and various online chatbots, people are turning to artificial intelligence (AI) to combat feelings of loneliness and grief.",
        "source": "CTV News",
        "link": "https://www.ctvnews.ca/canada/how-are-you-using-ai-to-cope-with-grief-we-want-to-hear-from-you-1.6893289",
        "published_at": "2024-05-19T18:47:00+00:00",
        "type": "article"
    },
    {
        "title": "Tech firm set to launch AI product, train students",
        "text": "Tech firm set to launch AI product, train students The chairman of Elite Global Intelligence Technology, Vwakpor Efuetanu has announced the launch of its AI product, &#8216;Elite Global AI.&#8217; The AI product which is set to launch fully in...The post Tech firm set to launch AI product, train students appeared first on The Nation Newspaper.",
        "source": "thenationonlineng",
        "link": "https://thenationonlineng.net/tech-firm-set-to-launch-ai-product-train-students/",
        "published_at": "2024-05-19T17:52:08+00:00",
        "type": "article"
    },
    {
        "title": "German, French Leaders Say Georgian Government, Ruling Party “Deviate” from EU Path",
        "text": "German, French Leaders Say Georgian Government, Ruling Party “Deviate” from EU Path German Chancellor Olaf Scholz and French President Emmanuel Macron issued a joint statement in response to the adoption of the foreign agent&#8217;s law by the Parliament of Georgia. The statement reads: &#8220;We, Germany and France, are deeply concerned about the situation in Georgia. Both of our countries have been staunch supporters of Georgia’s European path &#8230;",
        "source": "civil",
        "link": "https://civil.ge/archives/608228",
        "published_at": "2024-05-19T17:32:22+00:00",
        "type": "article"
    },
    {
        "title": "Brace up for AI, robotics, automation threats, CIPM boss charges workers",
        "text": "Brace up for AI, robotics, automation threats, CIPM boss charges workers The chairman of the Chartered Institute of Personnel Management (CIPM) Oyo state chapter, Omolara Onipede has tasked Nigerian workers in general and employment relations practitioners to retool themselves in order...The post Brace up for AI, robotics, automation threats, CIPM boss charges workers appeared first on The Nation Newspaper.",
        "source": "thenationonlineng",
        "link": "https://thenationonlineng.net/brace-up-for-ai-robotics-automation-threats-cipm-boss-charges-workers/",
        "published_at": "2024-05-19T17:20:26+00:00",
        "type": "article"
    },
    {
        "title": "Buildout, Inc. Unveils Game-Changing Technology Stack including an AI-Enabled Mobile App",
        "text": "Buildout, Inc. Unveils Game-Changing Technology Stack including an AI-Enabled Mobile App CHICAGO, IL / ACCESSWIRE / May 19, 2024 / Buildout, Inc., a leading provider of technology software and services for the commercial real estate (CRE) industry, is thrilled to announce the launch of...",
        "source": "finanznachrichten",
        "link": "https://www.finanznachrichten.de/nachrichten-2024-05/62271399-buildout-inc-unveils-game-changing-technology-stack-including-an-ai-enabled-mobile-app-200.htm",
        "published_at": "2024-05-19T17:02:00+00:00",
        "type": "article"
    },
    {
        "title": "Danny Batth hints he's set to become free agent less than a year after Norwich City move in 42-word message",
        "text": "Danny Batth hints he's set to become free agent less than a year after Norwich City move in 42-word message A popular former Sunderland defender is set to become a free agent less than a year after his Wearside departure",
        "source": "peterleemail",
        "link": "https://www.sunderlandecho.com/sport/football/sunderland-afc/danny-batth-set-to-become-free-agent-less-than-a-year-after-sunderland-exit-4634300",
        "published_at": "2024-05-19T16:59:31+00:00",
        "type": "article"
    },
    {
        "title": "Denver Broncos could resurrect career of former All-Pro wide receiver",
        "text": "Denver Broncos could resurrect career of former All-Pro wide receiver A wide receiver currently sitting on the free-agent market could make sense for the Denver Broncos for more than one reason.",
        "source": "Sporting News",
        "link": "https://www.sportingnews.com/us/nfl/denver-broncos/news/denver-broncos-could-resurrect-career-former-all-pro-wide-receiver/8b95a757cd7c9cf8ff4ec8aa",
        "published_at": "2024-05-19T16:36:34+00:00",
        "type": "article"
    },
    {
        "title": "20 Premier League free agents Leeds United could sign including Arsenal, Newcastle United and Everton stars",
        "text": "20 Premier League free agents Leeds United could sign including Arsenal, Newcastle United and Everton stars Leeds United could be in the market for some bargains whether they are in the Premier League or Championship next season.",
        "source": "calverleytoday",
        "link": "https://www.yorkshireeveningpost.co.uk/sport/football/leeds-united/20-premier-league-free-agents-leeds-united-could-sign-including-arsenal-newcastle-united-and-everton-stars-4632518",
        "published_at": "2024-05-19T16:29:19+00:00",
        "type": "article"
    },
    {
        "title": "Among AI infrastructure hopefuls, Qualcomm has become an unlikely ally",
        "text": "Among AI infrastructure hopefuls, Qualcomm has become an unlikely ally Among AI infrastructure hopefuls, Qualcomm has become an unlikely ally",
        "source": "theregister",
        "link": "https://go.theregister.com/feed/www.theregister.com/2024/05/19/ai_ampere_qualcomm/",
        "published_at": "2024-05-19T16:28:10+00:00",
        "type": "article"
    },
    {
        "title": "Bruins’ Jeremy Swayman Shares Clear Goal For Free Agency",
        "text": "Bruins’ Jeremy Swayman Shares Clear Goal For Free Agency Jeremy Swayman became emotional Friday night when he spoke about his deep appreciation for the Bruins and their fans. So, the comments the goaltender made about his NHL future Sunday morning did not come as any surprise. Swayman, who will be a restricted free agent this offseason, informed reporters of his &#8220;goal&#8221; to work out [&#8230;]",
        "source": "nesn",
        "link": "https://nesn.com/2024/05/bruins-jeremy-swayman-shares-clear-goal-for-free-agency/",
        "published_at": "2024-05-19T16:23:45+00:00",
        "type": "article"
    },
    {
        "title": "Fund thesis: AI is the X-factor ",
        "text": "Fund thesis: AI is the X-factor  Why VC firm Good Capital wants to be an early investor in AI-powered businesses",
        "source": "Business Line",
        "link": "https://www.thehindubusinessline.com/specials/emerging-entrepreneurs/fund-thesis-ai-is-the-x-factor/article68193039.ece",
        "published_at": "2024-05-19T15:31:00+00:00",
        "type": "article"
    },
    {
        "title": "Despite Salaries Below $500,000, Here’s How College Football Coaches Build Million-Dollar Empires",
        "text": "Despite Salaries Below $500,000, Here’s How College Football Coaches Build Million-Dollar Empires Ever wondered how college football coaches turn modest salaries into million-dollar empires? It’s not just about the game on the field. With base salaries often under $500,000, these coaches have found other ways to cash in big through perfectly crafted contracts. Behind many of these deals are savvy agents who know how to play the [&#8230;]The post Despite Salaries Below $500,000, Here’s How College Football Coaches Build Million-Dollar Empires appeared first on EssentiallySports.",
        "source": "Essentially Sports",
        "link": "https://www.essentiallysports.com/nfl-ncaa-news-despite-salaries-below-five-hundred-thousand-heres-how-college-football-coaches-build-million-dollar-empires/",
        "published_at": "2024-05-19T15:25:08+00:00",
        "type": "article"
    },
    {
        "title": "Customer service staff hired at HMRC – without speaking to a human",
        "text": "Customer service staff hired at HMRC – without speaking to a human HM Revenue & Customs is using artificial intelligence (AI) to recruit staff, with some customer service agents being hired without ever speaking to a human.",
        "source": "sports",
        "link": "https://ca.finance.yahoo.com/news/customer-staff-hired-hmrc-without-150155893.html",
        "published_at": "2024-05-19T15:01:55+00:00",
        "type": "article"
    },
    {
        "title": "Swecha to develop Telugu language-centric Large Language Models",
        "text": "Swecha to develop Telugu language-centric Large Language Models The project “Summer of AI” attempts to combine two objectives — a large-scale internship programme for first and second-year engineering students, trained in the basics of AI and then engaged in very large-scale data collection through interviews",
        "source": "The Hindu",
        "link": "https://www.thehindu.com/news/national/telangana/swecha-to-develop-telugu-language-centric-large-language-models/article68193678.ece",
        "published_at": "2024-05-19T14:26:00+00:00",
        "type": "article"
    },
    {
        "title": "Beursweek begint rustig, beleggers kijken uit naar Fed en Nvidia",
        "text": "Beursweek begint rustig, beleggers kijken uit naar Fed en Nvidia Beleggers maken zich op voor een rustig begin van de nieuwe beursweek. De Amsterdamse beurs is maandag open, maar veel Nederlandse bedrijven zijn op tweede pinksterdag gesloten. Laadpalenbedrijf Alfen uit Almere komt na de slotbel op maandag met een kwartaalbericht. De Federal Reserve publiceert woensdag notulen van de laatste beleidsvergadering. Dan komt ook maker van AI-chips Nvidia met cijfers.",
        "source": "nd",
        "link": "https://www.nd.nl/varia/varia/1224763/beursweek-begint-rustig-beleggers-kijken-uit-naar-fed-en-nvidia",
        "published_at": "2024-05-19T14:01:11+00:00",
        "type": "article"
    },
    {
        "title": "Putin pressas av hemliga agenter på hemmaplan",
        "text": "Putin pressas av hemliga agenter på hemmaplan Vladimir Putin pressas av hemliga pro-ukrainska agenter som gång på gång utför attacker mot den ryska järnvägen.&nbsp;– Det tär på Rysslands krigföringsförmåga och skapar en känsla av osäkerhet i det ryska samhället, konstaterar Patrik Oksanen, säkerhetspolitisk expert vid tankesmedjan Frivärld.",
        "source": "Expressen",
        "link": "https://www.expressen.se/nyheter/varlden/putin-pressas-av-hemliga--agenter-pa-hemmaplan/",
        "published_at": "2024-05-19T14:00:00+00:00",
        "type": "article"
    },
    {
        "title": "12 New York Giants free agents remain as OTAs begin",
        "text": "12 New York Giants free agents remain as OTAs begin Here are the 12 New York Giants free agents who remain unsigned as OTAs begin.",
        "source": "Sporting News",
        "link": "https://www.sportingnews.com/us/nfl/new-york-giants/news/new-york-giants-free-agents-remain-unsigned-otas/09e170f553d6275a223a6434",
        "published_at": "2024-05-19T13:34:02+00:00",
        "type": "article"
    },
    {
        "title": "Heroes in green: Guardia Civil rescues baby locked in car",
        "text": "Heroes in green: Guardia Civil rescues baby locked in car The Guardia Civil rescued a little girl who was locked inside a car after her mother accidentally left the keys inside. Neighbours who saw the distressed mother called the Torrevieja Guardia Civil for help. On May 13 at 8:30 AM, agents from the Citizen Security Unit (USECIC) of the Torrevieja Civil Guard were patrolling the [&#8230;]",
        "source": "euroweeklynews",
        "link": "https://euroweeklynews.com/2024/05/19/heroes-in-green-guardia-civil-rescues-baby-locked-in-car/",
        "published_at": "2024-05-19T13:23:25+00:00",
        "type": "article"
    },
    {
        "title": "Finland to present plan to push back migrants on Russian border",
        "text": "Finland to present plan to push back migrants on Russian border (marketscreener.com) Finland will propose a law next week allowing border agents to block asylum seekers trying to enter from Russia, the prime minister said on Sunday, a decision that could cause Helsinki to temporarily breach its international commitments. Finland shut its border with Russia last year to stop a growing number of arrivals from...https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Finland-to-present-plan-to-push-back-migrants-on-Russian-border-46769537/?utm_medium=RSS&utm_content=20240519",
        "source": "4-traders",
        "link": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Finland-to-present-plan-to-push-back-migrants-on-Russian-border-46769537/?utm_medium=RSS&utm_content=20240519",
        "published_at": "2024-05-19T13:02:14+00:00",
        "type": "article"
    },
    {
        "title": "Spam, junk … slop? The latest wave of AI behind the ‘zombie internet’",
        "text": "Spam, junk … slop? The latest wave of AI behind the ‘zombie internet’ Tech experts hope new term for carelessly automated AI webpages and images can illuminate its damaging impactYour email inbox is full of spam. Your letterbox is full of junk mail. Now, your web browser has its own affliction: slop.“Slop” is what you get when you shove artificial intelligence-generated material up on the web for anyone to view. Continue reading...",
        "source": "The Guardian",
        "link": "https://www.theguardian.com/technology/article/2024/may/19/spam-junk-slop-the-latest-wave-of-ai-behind-the-zombie-internet",
        "published_at": "2024-05-19T13:00:36+00:00",
        "type": "article"
    }
]