[
    {
        "title": "Brilliant Earth Announces Participation in TD Cowen 8th Annual Future of the Consumer Conference",
        "text": "Brilliant Earth Announces Participation in TD Cowen 8th Annual Future of the Consumer Conference Brilliant Earth Announces Participation in TD Cowen 8th Annual Future of the Consumer Conference",
        "source": "Investing.com | Stock Market Quotes &amp; Financial News",
        "link": "https://www.investing.com/news/press-releases/brilliant-earth-announces-participation-in-td-cowen-8th-annual-future-of-the-consumer-conference-93CH-3452776",
        "published_at": "2024-05-22T20:16:06+00:00",
        "type": "article"
    },
    {
        "title": "FCC proposes all AI-generated content in political ads must be disclosed",
        "text": "FCC proposes all AI-generated content in political ads must be disclosed The FCC has floated a requirement that AI-generated content be disclosed in political ads — but not banned. Chairwoman Jessica Rosenworcel made the official proposal Wednesday that the FCC investigate and seek comment on such a rule. (The agency already ruled AI-generated robocalls illegal, but that was more about them not conforming to automated call [&#8230;]© 2024 TechCrunch. All rights reserved. For personal use only.",
        "source": "TechCrunch",
        "link": "https://techcrunch.com/2024/05/22/fcc-proposes-all-ai-generated-content-in-political-ads-must-be-disclosed/",
        "published_at": "2024-05-22T20:06:06+00:00",
        "type": "article"
    },
    {
        "title": "US lawmakers advance bill to make it easier to curb exports of AI models",
        "text": "US lawmakers advance bill to make it easier to curb exports of AI models US lawmakers advance bill to make it easier to curb exports of AI models",
        "source": "Investing.com | Stock Market Quotes &amp; Financial News",
        "link": "https://www.investing.com/news/economy/us-lawmakers-advance-bill-to-make-it-easier-to-curb-exports-of-ai-models-3452512",
        "published_at": "2024-05-22T19:46:20+00:00",
        "type": "article"
    },
    {
        "title": "Political ads could require AI-generated content disclosures soon",
        "text": "Political ads could require AI-generated content disclosures soon Illustration by Cath Virginia / The Verge | Photos from Getty Images The chair of the Federal Communications Commission introduced a proposal Wednesday that could require political advertisers to disclose when they use AI-generated content on radio and TV ads.If the proposal is implemented, the FCC will seek comment on whether to require on-air and written disclosure of AI-generated content in political ads and will propose to apply these disclosure requirements to certain mediums. In a press release, the FCC notes that the disclosure requirements wouldn’t prohibit such content but would...",
        "source": "The Verge",
        "link": "https://www.theverge.com/2024/5/22/24162676/fcc-ai-generated-political-ads-disclosure-federal-communications-commission",
        "published_at": "2024-05-22T19:41:20+00:00",
        "type": "article"
    },
    {
        "title": "You can get rid of AI Overviews in Google Search",
        "text": "You can get rid of AI Overviews in Google Search Not everyone is a fan of AI Overviews. | Screenshot: Emma Roth / The Verge If you’ve searched for something on Google lately, you might’ve noticed a wall of text that appears before the actual search results. This feature, called AI Overviews, offers an AI-generated answer to certain queries. But it also pushes your list of links further down the page, which makes it a bit annoying to scroll past when you want to do your own research — and it will get even more annoying once Google starts stuffing ads into it.But even though Google doesn’t let you disable the feature, there are a few...",
        "source": "The Verge",
        "link": "https://www.theverge.com/24162621/google-search-ai-overviews-get-rid-of",
        "published_at": "2024-05-22T19:38:17+00:00",
        "type": "article"
    },
    {
        "title": "$100 million for equity: MacArthur Foundation’s new big bet and mandate",
        "text": "$100 million for equity: MacArthur Foundation’s new big bet and mandate The MacArthur Foundation will let loose another $100 million to a single project in the third installation of its global 100&Change competition, which for the first time requires applicants to address diversity, equity, and inclusion issues, the foundation announced Wednesday. The first 100&Change challenge was awarded in 2017 to a collaboration between Sesame Workshop and [&#8230;]",
        "source": "Financial Post | Canada Business News",
        "link": "https://financialpost.com/pmn/business-pmn/100-million-for-equity-macarthur-foundations-new-big-bet-and-mandate",
        "published_at": "2024-05-22T19:25:19+00:00",
        "type": "article"
    },
    {
        "title": "The best way to compost your food scraps",
        "text": "The best way to compost your food scraps The EPA estimates each person in the US sends 200 pounds of food to the landfill each year where it disgorges methane and contributes to climate change. Composted, those scraps turn into soil-feeding, carbon-capturing humus instead. If that sounds like the better option, you have a couple choices: compost at home, with or without a machine to help you out, or let someone else do the work.&nbsp;The DIY route requires a bit of science and a lot of labor, which I learned first-hand out of necessity living off-grid for five years. Adding a kitchen composting machine to the mix can help take some of...",
        "source": "Engadget",
        "link": "https://www.engadget.com/how-to-compost-at-home-140047133.html?src=rss",
        "published_at": "2024-05-22T19:00:36+00:00",
        "type": "article"
    },
    {
        "title": "Fed Minutes Show Officials Were Wary About Inflation at May Meeting",
        "text": "Fed Minutes Show Officials Were Wary About Inflation at May Meeting Federal Reserve policymakers were still willing to raise rates if the economy surprised them, notes from their most recent meeting suggested.",
        "source": "The New York Times",
        "link": "https://www.nytimes.com/2024/05/22/business/economy/federal-reserve-minutes-may.html",
        "published_at": "2024-05-22T18:56:22+00:00",
        "type": "article"
    },
    {
        "title": "Masterminds Education Revolutionizes Education: Introducing the VIP Program",
        "text": "Masterminds Education Revolutionizes Education: Introducing the VIP Program Masterminds Education fosters a generation growing up with academic proficiency, confidence, and creativity to navigate life's many challenges.",
        "source": "International Business Times Au",
        "link": "https://www.ibtimes.com.au/masterminds-education-revolutionizes-education-introducing-vip-program-1848216",
        "published_at": "2024-05-22T18:48:21+00:00",
        "type": "article"
    },
    {
        "title": "How Trump's hush money trial verdict could affect the 2024 election",
        "text": "How Trump's hush money trial verdict could affect the 2024 election How Trump's hush money trial verdict could affect the 2024 election",
        "source": "Investing.com | Stock Market Quotes &amp; Financial News",
        "link": "https://www.investing.com/news/world-news/how-trumps-hush-money-trial-verdict-could-affect-the-2024-election-3451519",
        "published_at": "2024-05-22T18:31:09+00:00",
        "type": "article"
    },
    {
        "title": "10 of the highest-paying public health jobs right now",
        "text": "10 of the highest-paying public health jobs right now Four years after the pandemic shined a spotlight on public health, it remains an in-demand field.",
        "source": "Fortune",
        "link": "https://fortune.com/education/careers/public-health-jobs/",
        "published_at": "2024-05-22T18:27:57+00:00",
        "type": "article"
    },
    {
        "title": "Remote Work, Aging Tech Targeted by Canada Cybersecurity Plan",
        "text": "Remote Work, Aging Tech Targeted by Canada Cybersecurity Plan The Canadian government released its first-ever cybersecurity strategy on Wednesday, with the aim of addressing challenges posed by remote work, cloud computing, aging infrastructure and recruitment.",
        "source": "Financial Post | Canada Business News",
        "link": "https://financialpost.com/pmn/business-pmn/remote-work-aging-tech-targeted-by-canada-cybersecurity-plan",
        "published_at": "2024-05-22T18:21:15+00:00",
        "type": "article"
    },
    {
        "title": "New research places the sun's magnetic field close to the surface, upending decades of theories",
        "text": "New research places the sun's magnetic field close to the surface, upending decades of theories New research indicates the sun’s magnetic field originates close to the surface and not deep within the star, according to findings published in the journal Nature. This upends decades of prevailing scientific thought that placed the field more than 130,000 miles below the surface of the sun. It also brings us closer to understanding the nature of the sun’s magnetic field, which has been on scientist’s minds since Galileo.The study, led by Northwestern University and a team of international researchers, suggests that the magnetic field actually generates 20,000 miles below the surface...",
        "source": "Engadget",
        "link": "https://www.engadget.com/new-research-places-the-suns-magnetic-field-close-to-the-surface-upending-decades-of-theories-182059055.html?src=rss",
        "published_at": "2024-05-22T18:20:59+00:00",
        "type": "article"
    },
    {
        "title": "Analysis-Struggling economy awaits winner of British election",
        "text": "Analysis-Struggling economy awaits winner of British election Analysis-Struggling economy awaits winner of British election",
        "source": "Investing.com | Stock Market Quotes &amp; Financial News",
        "link": "https://www.investing.com/news/economy/analysisstruggling-economy-awaits-winner-of-british-election-3452575",
        "published_at": "2024-05-22T18:02:42+00:00",
        "type": "article"
    },
    {
        "title": "UK PM Sunak Calls General Election For July 4",
        "text": "UK PM Sunak Calls General Election For July 4 UK Prime Minister Rishi Sunak on Wednesday set a general election date for July 4, ending months of speculation but not the doom-laden forecasts about the size of the government's expected defeat.",
        "source": "International Business Times Au",
        "link": "https://www.ibtimes.com.au/uk-pm-sunak-calls-general-election-july-4-1848214",
        "published_at": "2024-05-22T17:54:38+00:00",
        "type": "article"
    },
    {
        "title": "Salesforce enhances AI tools for marketing and commerce",
        "text": "Salesforce enhances AI tools for marketing and commerce Salesforce enhances AI tools for marketing and commerce",
        "source": "Investing.com | Stock Market Quotes &amp; Financial News",
        "link": "https://www.investing.com/news/company-news/salesforce-enhances-ai-tools-for-marketing-and-commerce-93CH-3452554",
        "published_at": "2024-05-22T17:47:44+00:00",
        "type": "article"
    },
    {
        "title": "JPMorgan's Investor Day has read-throughs for banks in general, BofA says",
        "text": "JPMorgan's Investor Day has read-throughs for banks in general, BofA says JPMorgan's Investor Day has read-throughs for banks in general, BofA says",
        "source": "Seeking Alpha",
        "link": "https://seekingalpha.com/news/4109464-jpmorgans-investor-day-has-read-throughs-for-banks-in-general-bofa-says?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
        "published_at": "2024-05-22T17:46:16+00:00",
        "type": "article"
    },
    {
        "title": "Rishi Sunak Declares UK General Election On July 4",
        "text": "Rishi Sunak Declares UK General Election On July 4 Rishi Sunak Declares UK General Election On July 4",
        "source": "Bloomberg | Latest And Live Business",
        "link": "https://www.ndtvprofit.com/world/rishi-sunak-declares-uk-general-election-on-july-4",
        "published_at": "2024-05-22T17:25:46+00:00",
        "type": "article"
    },
    {
        "title": "T-Mobile is raising prices on several of its plans",
        "text": "T-Mobile is raising prices on several of its plans Illustration by Alex Castro / The Verge T-Mobile has begun notifying customers that it’s hiking their rates by as much as $5 per line per month. The company’s help account on X confirmed the price increase, telling one person that it was “adjusting prices to respond to rising costs.” Reports suggest the hike applies to older plans, including One, Magenta, Magenta 55 Plus / Military, and Simple Choice, but the full extent isn’t known.T-Mobile told employees that it is notifying the “small fraction of customers” who are affected by the change today, May 22nd, according to an...",
        "source": "The Verge",
        "link": "https://www.theverge.com/2024/5/22/24162490/t-mobile-price-increase-magenta-one-simple-choice-plans",
        "published_at": "2024-05-22T17:24:32+00:00",
        "type": "article"
    },
    {
        "title": "Big Oil Investigation Sent to Justice Department by Democrats",
        "text": "Big Oil Investigation Sent to Justice Department by Democrats Democrats are asking the Department of Justice to investigate major oil companies and their trade groups following a congressional probe that concluded with allegations that Big Oil spent decades deceiving the public about the affects of climate change.",
        "source": "Financial Post | Canada Business News",
        "link": "https://financialpost.com/pmn/business-pmn/big-oil-investigation-sent-to-justice-department-by-democrats",
        "published_at": "2024-05-22T16:49:37+00:00",
        "type": "article"
    },
    {
        "title": "Wild + Pine Breaks Ground on the Largest Afforestation Project in Western Canada to Benefit Climate and Biodiversity",
        "text": "Wild + Pine Breaks Ground on the Largest Afforestation Project in Western Canada to Benefit Climate and Biodiversity • StoneWoods Forest Carbon works to restore 3,700 acres of degraded land to protect local biodiversity and draw down carbon emissions. • The project groundbreaking coincides with the International Day for Biological Diversity. EDMONTON, Alberta, May 22, 2024 (GLOBE NEWSWIRE) &#8212; Wild + Pine, a Certified B Corporation that develops verified nature-based carbon removal assets, [&#8230;]",
        "source": "Financial Post | Canada Business News",
        "link": "https://financialpost.com/globe-newswire/wild-pine-breaks-ground-on-the-largest-afforestation-project-in-western-canada-to-benefit-climate-and-biodiversity",
        "published_at": "2024-05-22T16:44:36+00:00",
        "type": "article"
    },
    {
        "title": "Wages, NHS and migration: Tory record in charts",
        "text": "Wages, NHS and migration: Tory record in charts Voters will judge the changes in the UK over the past 14 years",
        "source": "Financial Times",
        "link": "https://www.ft.com/content/ddde6306-e094-4617-ba1e-8e73b49d057f",
        "published_at": "2024-05-22T16:40:45+00:00",
        "type": "article"
    },
    {
        "title": "PM Rishi Sunak's Cabinet Meeting Fuels UK General Election Speculation Frenzy",
        "text": "PM Rishi Sunak's Cabinet Meeting Fuels UK General Election Speculation Frenzy PM Rishi Sunak's Cabinet Meeting Fuels UK General Election Speculation Frenzy",
        "source": "Bloomberg | Latest And Live Business",
        "link": "https://www.ndtvprofit.com/world/pm-rishi-sunaks-cabinet-meeting-fuels-uk-general-election-speculation-frenzy",
        "published_at": "2024-05-22T16:32:38+00:00",
        "type": "article"
    },
    {
        "title": "A comprehensive list of 2024 tech layoffs",
        "text": "A comprehensive list of 2024 tech layoffs The tech layoff wave is still going strong in 2024. Following significant workforce reductions in 2022 and 2023, this year has already seen 60,000 job cuts across 254 companies, according to independent layoffs tracker Layoffs.fyi. Companies like Tesla, Amazon, Google, TikTok, Snap and Microsoft have conducted sizable layoffs in the first months of 2024. Smaller-sized [&#8230;]© 2024 TechCrunch. All rights reserved. For personal use only.",
        "source": "TechCrunch",
        "link": "https://techcrunch.com/2024/05/22/tech-layoffs-2023-list/",
        "published_at": "2024-05-22T16:30:46+00:00",
        "type": "article"
    },
    {
        "title": "AI ‘will bring the biggest revolution the creative sector has seen,’ Björn Ulvaeus says in CISAC’s latest annual report",
        "text": "AI ‘will bring the biggest revolution the creative sector has seen,’ Björn Ulvaeus says in CISAC’s latest annual report The global umbrella group of collection societies is urging rightsholders to fight for their rights in the age of AISource",
        "source": "Music Business Worldwide",
        "link": "https://www.musicbusinessworldwide.com/ai-will-bring-the-biggest-revolution-the-creative-sector-has-seen-bjorn-ulvaeus-says-in-cisacs-latest-annual-report/",
        "published_at": "2024-05-22T16:29:03+00:00",
        "type": "article"
    }
]