[
    {
        "title": "I traded my mechanical keyboard for a magnetic one. I’m not going back",
        "text": "I traded my mechanical keyboard for a magnetic one. I’m not going back When my old mechanical keyboard broke down, I decided to go magnetic and try Turtle Beach's Vulcan 2 TKL Pro.",
        "source": "digitaltrends",
        "link": "https://www.digitaltrends.com/computing/vulcan-2-tkl-pro-keyboard-hands-on/",
        "published_at": "2024-05-19T04:01:06+00:00",
        "type": "article"
    },
    {
        "title": "A Sea of hope: Marine turtles released",
        "text": "A Sea of hope: Marine turtles released THE El Valle Regional Wildlife Recovery Centre has achieved a significant milestone by releasing all marine turtles admitted for rehabilitation back into their natural habitat. Over the past two years, the centre has successfully rehabilitated and released seven marine turtles, confirming its crucial role in wildlife conservation efforts. Marine Turtle Rehabilitation: A Success Story Juan [&#8230;]",
        "source": "euroweeklynews",
        "link": "https://euroweeklynews.com/2024/05/18/a-sea-of-hope-marine-turtles-released/",
        "published_at": "2024-05-18T17:19:30+00:00",
        "type": "article"
    },
    {
        "title": "Are turtles dinosaurs? Their evolution took its own distinct path",
        "text": "Are turtles dinosaurs? Their evolution took its own distinct path They're more like cousins than siblings.",
        "source": "zmescience",
        "link": "https://www.zmescience.com/feature-post/natural-sciences/geology-and-paleontology/dinosaurs/are-turtles-dinosaurs-their-evolution-took-its-own-distinct-path/",
        "published_at": "2024-05-17T22:50:24+00:00",
        "type": "article"
    },
    {
        "title": "Microplastics may slow the rate at which carbon is pulled from the sea surface to the depths",
        "text": "Microplastics may slow the rate at which carbon is pulled from the sea surface to the depths It turns out plastics in the ocean do more than suffocate turtles, fish and other marine life.",
        "source": "Phys.org - News And Articles On Science And Technology",
        "link": "https://phys.org/news/2024-05-microplastics-carbon-sea-surface-depths.html",
        "published_at": "2024-05-17T15:36:03+00:00",
        "type": "article"
    },
    {
        "title": "One of Denver’s favorite poke shops shutters suddenly",
        "text": "One of Denver’s favorite poke shops shutters suddenly The owners said they are on the hunt for a new, larger space for Turtle Boat.",
        "source": "photos",
        "link": "https://www.denverpost.com/2024/05/17/turtle-boat-poke-shop-closes-big-apple-bodega-opening-denver/",
        "published_at": "2024-05-17T12:18:18+00:00",
        "type": "article"
    },
    {
        "title": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild",
        "text": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild Marine scientists will track the green sea turtle, a threatened species, to see if it sticks around the San Gabriel River or heads to warmer waters off Mexico.",
        "source": "dailybreeze",
        "link": "https://www.dailybreeze.com/2024/05/16/green-sea-turtle-rehabbed-by-aquarium-of-the-pacific-released-into-the-wild/",
        "published_at": "2024-05-16T22:55:38+00:00",
        "type": "article"
    },
    {
        "title": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild",
        "text": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild Marine scientists will track the green sea turtle, a threatened species, to see if it sticks around the San Gabriel River or heads to warmer waters off Mexico.",
        "source": "ocregister",
        "link": "https://www.ocregister.com/2024/05/16/green-sea-turtle-rehabbed-by-aquarium-of-the-pacific-released-into-the-wild/",
        "published_at": "2024-05-16T22:55:38+00:00",
        "type": "article"
    },
    {
        "title": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild",
        "text": "Green sea turtle rehabbed by Aquarium of the Pacific released into the wild Marine scientists will track the green sea turtle, a threatened species, to see if it sticks around the San Gabriel River or heads to warmer waters off Mexico.",
        "source": "dailynews",
        "link": "https://www.dailynews.com/2024/05/16/green-sea-turtle-rehabbed-by-aquarium-of-the-pacific-released-into-the-wild/",
        "published_at": "2024-05-16T22:55:38+00:00",
        "type": "article"
    },
    {
        "title": "Forest Officials Foil Illegal Trafficking of 1600 Turtles",
        "text": "Forest Officials Foil Illegal Trafficking of 1600 Turtles Forest Officials Foil Illegal Trafficking of 1600 Turtles",
        "source": "deccanchronicle",
        "link": "https://www.deccanchronicle.com/nation/forest-officials-foil-illegal-trafficking-of-1600-turtles-894335",
        "published_at": "2024-05-16T20:09:46+00:00",
        "type": "article"
    },
    {
        "title": "PDP launches Victrix Gambit Prime Wired Tournament Controller for Xbox and PC",
        "text": "PDP launches Victrix Gambit Prime Wired Tournament Controller for Xbox and PC Not a fan of wireless controllers? Well, there is some great news for you! You see, Performance Designed Products LLC (a Turtle Beach company) has launched the Victrix Gambit Prime Wired Tournament Controller for Xbox Series X&#124;S, Xbox One, and PC. The standout feature of the Victrix Gambit Prime is its patented Dual Core Technology, which promises up to eight times faster input responses. This reduction in lag is crucial for gamers looking to maximize their speed and performance. Additionally, the controller comes with 12 swappable components, allowing users to customize it to fit their...",
        "source": "betanews",
        "link": "https://betanews.com/2024/05/16/victrix-gambit-prime-controller-launch/",
        "published_at": "2024-05-16T13:15:50+00:00",
        "type": "article"
    },
    {
        "title": "PDP's Victrix Gambit Prime Wired Tournament Controller Is Engineered to Win & Available Now",
        "text": "PDP's Victrix Gambit Prime Wired Tournament Controller Is Engineered to Win & Available Now (marketscreener.com) PDP&rsquo;s Victrix Gambit Prime Wired Tournament Controller for Xbox is Built for Speed &amp; Offers Gamers Maximum Customizationhttps://www.marketscreener.com/quote/stock/TURTLE-BEACH-CORPORATION-45013454/news/PDP-s-Victrix-Gambit-Prime-Wired-Tournament-Controller-Is-Engineered-to-Win-Available-Now-46747782/?utm_medium=RSS&utm_content=20240516",
        "source": "4-traders",
        "link": "https://www.marketscreener.com/quote/stock/TURTLE-BEACH-CORPORATION-45013454/news/PDP-s-Victrix-Gambit-Prime-Wired-Tournament-Controller-Is-Engineered-to-Win-Available-Now-46747782/?utm_medium=RSS&utm_content=20240516",
        "published_at": "2024-05-16T12:34:07+00:00",
        "type": "article"
    },
    {
        "title": "‘Turtles All the Way Down’: Required viewing for Hoosiers",
        "text": "‘Turtles All the Way Down’: Required viewing for Hoosiers Thank you for reading! Help support local journalism: SUBSCRIBE HERE for award-winning local news and unlimited digital access. For a low monthly rate, or try one day for 99¢.&#160;Subscribers, please&#160;LOGIN to continue.&#160;",
        "source": "news-banner",
        "link": "https://news-banner.com/2024/05/turtles-all-the-way-down-required-viewing-for-hoosiers/",
        "published_at": "2024-05-16T09:21:57+00:00",
        "type": "article"
    },
    {
        "title": "Thailand frees endangered turtles with trackers to boost conservation hopes",
        "text": "Thailand frees endangered turtles with trackers to boost conservation hopes (marketscreener.com) Off the shore of Thailand's resort island of Phuket, marine conservationists have released 11 baby leatherback sea turtles into the Indian Ocean, hoping they can thrive in the wild and return in two decades to reproduce. The release of the year-old turtles, each about the size of a rugby ball, follows an intense conservation...https://www.marketscreener.com/news/latest/Thailand-frees-endangered-turtles-with-trackers-to-boost-conservation-hopes--46740240/?utm_medium=RSS&utm_content=20240515",
        "source": "4-traders",
        "link": "https://www.marketscreener.com/news/latest/Thailand-frees-endangered-turtles-with-trackers-to-boost-conservation-hopes--46740240/?utm_medium=RSS&utm_content=20240515",
        "published_at": "2024-05-16T01:03:38+00:00",
        "type": "article"
    },
    {
        "title": "Jefferson Starship drummer John Barbata dead at 79 (Entertainment)",
        "text": "Jefferson Starship drummer John Barbata dead at 79 (Entertainment) Jefferson Starship and Jefferson Airplane drummer John Barbata has died aged 79. The musician is reported to have passed away on May 8. A cause of death is not known at this time. Barbata also played with the likes of Crosby, Stills, Nash and Young, The Turtles, and The Sentinels. A statement on ...",
        "source": "Castanet",
        "link": "https://www.castanet.net/news/Entertainment/487505/Jefferson-Starship-drummer-John-Barbata-dead-at-79",
        "published_at": "2024-05-15T13:11:00+00:00",
        "type": "article"
    },
    {
        "title": "Turtles All The Way Down Preview",
        "text": "Turtles All The Way Down Preview Turtles All The Way Down PreviewRelated posts:Chuggington Tales From The Rails Halloween Sneak PeekLicorice Pizza Trailer RevealedComing Out Colton Sneak Peek",
        "source": "tvgrapevine",
        "link": "https://www.tvgrapevine.com/2024/05/turtles-all-the-way-down-preview/",
        "published_at": "2024-05-15T08:00:52+00:00",
        "type": "article"
    },
    {
        "title": "John Barbata, Turtles and C.S.N.Y. Drummer, Dies at 79",
        "text": "John Barbata, Turtles and C.S.N.Y. Drummer, Dies at 79 Barbata belonged to marquee bands of the late ’60s and ’70s, drumming on smash hits such as “Happy Together,” the first song he recorded with the Turtles.",
        "source": "The New York Times",
        "link": "https://www.nytimes.com/2024/05/15/arts/music/john-barbata-dead.html",
        "published_at": "2024-05-15T04:43:15+00:00",
        "type": "article"
    },
    {
        "title": "Jefferson Starship drummer John Barbata has died, age 79",
        "text": "Jefferson Starship drummer John Barbata has died, age 79 Barbata also played for Jefferson Airplane, The Turtles and Crosby, Stills, Nash & Young among othersThe post Jefferson Starship drummer John Barbata has died, age 79 appeared first on NME.",
        "source": "nme",
        "link": "https://www.nme.com/news/music/jefferson-starship-drummer-john-barbata-has-died-age-79-3756280?utm_source=rss&utm_medium=rss&utm_campaign=jefferson-starship-drummer-john-barbata-has-died-age-79",
        "published_at": "2024-05-15T02:58:21+00:00",
        "type": "article"
    },
    {
        "title": "Ocean Action on Global Agenda as Negotiations to Save Biodiversity Deepen",
        "text": "Ocean Action on Global Agenda as Negotiations to Save Biodiversity Deepen The oceans are as fascinating as they are mysterious. Home to the largest animals to ever live on Earth and billions of the tiniest, the top 100 meters of the open oceans host the majority of sea life, such as fish, turtles, and marine mammals. But there is another world far below the surface. In [&#8230;]",
        "source": "IPS News Agency",
        "link": "https://www.ipsnews.net/2024/05/ocean-action-on-global-agenda-as-negotiations-to-save-biodiversity-resources-deepen/?utm_source=rss&utm_medium=rss&utm_campaign=ocean-action-on-global-agenda-as-negotiations-to-save-biodiversity-resources-deepen",
        "published_at": "2024-05-15T02:07:04+00:00",
        "type": "article"
    },
    {
        "title": "4th annual FreshGrass Festival in Bentonville this weekend",
        "text": "4th annual FreshGrass Festival in Bentonville this weekend The two-day plunge into all things roots and bluegrass has a few repeat names from 2023, but the lineup is mostly new, with the unblinking Jason Isbell and the 400 Unit and the occasionally frenzied Trampled by Turtles leading the way as headliners.The post 4th annual FreshGrass Festival in Bentonville this weekend appeared first on Arkansas Times.",
        "source": "arktimes",
        "link": "https://arktimes.com/rock-candy/2024/05/14/4th-annual-freshgrass-festival-in-bentonville-this-weekend",
        "published_at": "2024-05-14T16:21:57+00:00",
        "type": "article"
    },
    {
        "title": "Michelle Buteau, Ilana Glazer and Pamela Adlon on 'Babes'; Blake Crouch's 'Dark Matter'; John Green on 'Turtles All the Way Down' Movie; Future of TikTok",
        "text": "Michelle Buteau, Ilana Glazer and Pamela Adlon on 'Babes'; Blake Crouch's 'Dark Matter'; John Green on 'Turtles All the Way Down' Movie; Future of TikTok The new comedy, \"Babes,\" stars Ilana Glazer (who also co-wrote the movie) and Michelle Buteau as childhood best friends. When Glazer's character becomes pregnant from a one-night stand and decides to keep it, she seeks solace--and guidance--from her best friend, a mother of two. It's the feature length directorial debut of actor/writer Pamela Adlon and all three join to discuss.A new TV series is based on author Blake Crouch's bestselling novel, Dark Matter. It stars Joel Edgerton as a scientist who is abducted and dropped into another version of his life. Crouch is the series...",
        "source": "wnyc",
        "link": "http://www.wnyc.org/story/michelle-buteau-ilana-glazer-and-pamela-adlon-babes-blake-crouchs-dark-matter-john-green-turtles-all-way-down-movie-future-tiktok/",
        "published_at": "2024-05-14T14:58:03+00:00",
        "type": "article"
    },
    {
        "title": "Turtle Beach-Anleger sollten sich noch gedulden!",
        "text": "Turtle Beach-Anleger sollten sich noch gedulden! In den letzten Wochen gab es keine eindeutige Veränderung in der Kommunikation über Turtle Beach in den sozialen Medien. Es gab keine deutliche Verschiebung hin zu positiven oder negativen Diskussionen. Daher erhält die Aktie von der Redaktion eine \"Neutral\"-Bewertung. Die Intensität der Diskussionen in den sozialen Medien liefert Anzeichen dafür, ob das Unternehmen derzeit viel oder wenig im Fokus der Anleger steht. [mehr]",
        "source": "aktiencheck",
        "link": "https://www.aktiencheck.de/news/Artikel-Turtle_Beach_Anleger_sollten_sich_noch_gedulden-16878530",
        "published_at": "2024-05-14T13:25:49+00:00",
        "type": "article"
    },
    {
        "title": "Catch And Release Can Give Sea Turtles The Bends",
        "text": "Catch And Release Can Give Sea Turtles The Bends Six out of seven sea turtle species are endangered, and humans are primarily responsible. Commercial fishing activities are the largest human-caused disturbance to sea turtles due to accidental capture.Fishers are typically unaware if a sea turtle is caught in their net until it’s completely pulled out of the water. However, releasing sea turtles without veterinary evaluations can be harmful. When accidentally caught, the turtles’ normal diving processes are interrupted, which can cause abnormal gas in their organs, gas emboli, to form. Veterinarians around the globe are working to...",
        "source": "eurasiareview",
        "link": "https://api.follow.it/track-rss-story-click/v3/Qw9d99ManWcycbMFRmo19e9WSSr4-0sP",
        "published_at": "2024-05-13T23:02:39+00:00",
        "type": "article"
    },
    {
        "title": "‘The ambition is gold’: Kate Shortman and Izzy Thorpe target Olympic splash",
        "text": "‘The ambition is gold’: Kate Shortman and Izzy Thorpe target Olympic splash University students believe they can deliver Great Britain’s first-ever artistic swimming medals in Paris this summerTwo of the London Aquarium’s biggest attractions, the green sea turtles Boris and Dougie, had unexpected guests on Monday: the newest additions to Team GB’s squad for the Olympics with bold plans to take artistic swimming out of its shell.Great Britain has never won an Olympic medal in the 40-year history of the event, previously known as synchronised swimming. Yet two university students, Kate Shortman and Izzy Thorpe, are set to make the most unlikely of splashes at the...",
        "source": "The Guardian",
        "link": "https://www.theguardian.com/sport/article/2024/may/14/kate-shortman-izzy-thorpe-artistic-swimming",
        "published_at": "2024-05-13T23:01:19+00:00",
        "type": "article"
    },
    {
        "title": "Kamloops gets nod to host 2025 National Aboriginal Hockey Championships (Kamloops)",
        "text": "Kamloops gets nod to host 2025 National Aboriginal Hockey Championships (Kamloops) Kamloops has been chosen to host the National Aboriginal Hockey Championships next year, an event that will see under-18 First Nations, Inuit and Metis hockey players compete for the Turtle Island Cup. The six-day tournament will be held next year from May 5 to May 10. &ldquo;As the proud host of th...",
        "source": "Castanet",
        "link": "https://www.castanet.net/news/Kamloops/487177/Kamloops-gets-nod-to-host-2025-National-Aboriginal-Hockey-Championships",
        "published_at": "2024-05-13T22:31:00+00:00",
        "type": "article"
    },
    {
        "title": "‘They know where they’re going’: Watch out for turtles on the roadways  ",
        "text": "‘They know where they’re going’: Watch out for turtles on the roadways   “If you can safely move it, please do, but also respect that that's a wild turtle and that is where it belongs,” said state biologist Luke Groff. Read the story on VTDigger here: ‘They know where they’re going’: Watch out for turtles on the roadways  .",
        "source": "vtdigger",
        "link": "https://vtdigger.org/2024/05/13/they-know-where-theyre-going-watch-out-for-turtles-on-the-roadways/",
        "published_at": "2024-05-13T21:49:16+00:00",
        "type": "article"
    }
]